app/controllers/handbooks_controller.rb

  def index
    @handbooks = Handbook.all
---
SELECT "handbooks".* FROM "handbooks"

  def create
    @handbook = Handbook.new(handbook_params)

    respond_to do |format|
      if @handbook.save
---
INSERT INTO "handbooks" ("title", "description", "icon_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_handbook
      @handbook = Handbook.find(params[:id])
---
SELECT  "handbooks".* FROM "handbooks" WHERE "handbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]