app/controllers/worships_controller.rb

  def index
    @worships = Worship.all
---
SELECT "worships".* FROM "worships"

  def show
    @worships = Worship.find(params[:id])
---
SELECT  "worships".* FROM "worships" WHERE "worships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @worship = Worship.new(worship_params)

    respond_to do |format|
      if @worship.save
---
INSERT INTO "worships" ("days", "created_at", "updated_at") VALUES (?, ?, ?)  [["days", "Test"], ["created_at", "2018-08-01 16:46:32.604637"], ["updated_at", "2018-08-01 16:46:32.604637"]]

  def update
    respond_to do |format|
      if @worship.update(worship_params)
---
UPDATE "worships" SET "days" = ?, "updated_at" = ? WHERE "worships"."id" = ?  [["days", "اليوم الأول الكعبة يقوم فيه ..."], ["updated_at", "2018-08-02 02:19:33.889246"], ["id", 2]]

  def destroy
    @worship.destroy
---
DELETE FROM "worships" WHERE "worships"."id" = ?  [["id", 1]]

    def set_worship
      @worship = Worship.find(params[:id])
---
SELECT  "worships".* FROM "worships" WHERE "worships"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]